# Core
tap "homebrew/core"

brew "argocd"
brew "awscli"
brew "azure-cli"
brew "bash"
brew "caddy"
brew "chart-testing"
brew "checkov"
brew "cmake"
brew "coreutils"
brew "ctop"
brew "curl"
brew "findutils"
brew "fzf"
brew "gawk"
brew "gh"
brew "git"
brew "git-lfs"
brew "gnu-sed"
brew "gnu-units"
brew "grep"
brew "helm"
brew "helm-docs"
brew "htop"
brew "httpie"
brew "jq"
brew "k9s"
brew "mas"
brew "neofetch"
brew "neovim"
brew "nvm"
brew "p7zip"
brew "pipx"
brew "poetry"
brew "rabbitmq"
brew "redis"
brew "ripgrep"
brew "screen"
brew "shellcheck"
brew "spicetify-cli"
brew "terraform-docs"
brew "terragrunt"
brew "tfenv"
brew "tflint"
brew "tfsec"
brew "tldr"
brew "vault"
brew "wget"
brew "yq"

# Standard casks
tap "homebrew/cask"
tap "homebrew/cask-versions" # For beta version
cask "alt-tab"
cask "bettertouchtool"
cask "dbeaver-community"
cask "docker"
cask "dotnet-sdk"
cask "drawio"
cask "figma"
cask "firefox"
cask "firefox-developer-edition"
cask "github"
cask "google-chrome"
cask "google-chrome-canary"
cask "google-cloud-sdk"
cask "iina"
cask "iterm2"
cask "linearmouse"
cask "obs"
cask "safari-technology-preview"
cask "spotify"
cask "visual-studio-code"

# Misc
## Fonts
tap "homebrew/cask-fonts"
cask "font-cascadia-code-pl"
cask "font-cascadia-mono-pl"
cask "font-lato"
cask "font-open-sans"
cask "font-roboto"
cask "font-source-code-pro"
cask "font-source-serif-pro"
cask "font-ubuntu"

# Custom taps
tap "azure/kubelogin"
brew "azure/kubelogin/az-kubelogin"

tap "helm/tap"
brew "helm/tap/chart-releaser"

# Mac App Store
mas "Bitwarden", id: 1352778147
mas "AdGuard for Safari", id: 1440147259
