# Core
brew "actionlint"
brew "argocd"
brew "bash"
brew "caddy"
brew "chart-testing"
brew "cmake"
brew "coreutils"
brew "ctop"
brew "curl"
brew "duckdb"
brew "findutils"
brew "ffmpeg"
brew "fnm"
brew "fzf"
brew "gawk"
brew "gh"
brew "git"
brew "git-lfs"
brew "go"
brew "gnu-sed"
brew "gnu-units"
brew "grep"
brew "helm"
brew "helm-docs"
brew "htop"
brew "httpie"
brew "imagemagick"
brew "jq"
brew "k9s"
brew "kubernetes-cli"
brew "mas"
brew "neofetch"
brew "neovim"
brew "p7zip"
brew "parallel"
brew "pipx"
brew "poetry"
brew "postgresql@16"
brew "pwgen"
brew "redis"
brew "ripgrep"
brew "screen"
brew "shellcheck"
brew "spicetify-cli"
brew "tldr"
brew "tokei"
brew "wget"
brew "yq"

# Standard casks
cask "alt-tab"
cask "bettertouchtool"
cask "dbeaver-community"
cask "drawio"
cask "figma"
cask "firefox"
cask "firefox@developer-edition"
cask "github"
cask "google-chrome"
cask "google-chrome@canary"
cask "iina"
cask "iterm2"
cask "linearmouse"
cask "microsoft-edge"
cask "obs"
cask "safari-technology-preview"
cask "spotify"
cask "visual-studio-code"

# Misc
## Fonts
cask "font-cascadia-code-pl"
cask "font-cascadia-mono-pl"
cask "font-inter"
cask "font-jetbrains-mono"
cask "font-lato"
cask "font-meslo-for-powerlevel10k"
cask "font-open-sans"
cask "font-roboto"
cask "font-source-code-pro"
cask "font-ubuntu"

# Custom taps
tap "helm/tap"
brew "helm/tap/chart-releaser"

# Mac App Store
mas "Bitwarden", id: 1352778147
mas "AdGuard for Safari", id: 1440147259
